let district = [
    {
        name: "Автономная Республика Крым",
        city: [
            {
                name: "Алупка"
            },
            {
                name: "Алушта"
            },
            {
                name: "Армянск"
            },
            {
                name: "Бахчисарай"
            },
            {
                name: "Белогорск"
            },
            {
                name: "Джанкой"
            },
            {
                name: "Евпатория"
            },
            {
                name: "Керчь"
            },
            {
                name: "Красноперекопск"
            },
            {
                name: "Саки"
            },
            {
                name: "Севастополь"
            },
            {
                name: "Симферополь"
            },
            {
                name: "Старый Крым"
            },
            {
                name: "Судак"
            },
            {
                name: "Феодосия"
            },
            {
                name: "Щёлкино"
            },
            {
                name: "Ялта"
            }
        ]
    },
    {
        name: "Винницкая область",
        city: [
            {
                name: "Бар"
            },
            {
                name: "Бершадь"
            },
            {
                name: "Винница"
            },
            {
                name: "Гайсин"
            },
            {
                name: "Жмеринка"
            },
            {
                name: "Казатин"
            },
            {
                name: "Калиновка"
            },
            {
                name: "Ладыжин"
            },
            {
                name: "Могилёв-Подольский"
            },
            {
                name: "Немиров"
            },
            {
                name: "Погребище"
            },
            {
                name: "Тульчин"
            },
            {
                name: "Хмельник"
            },
            {
                name: "Шаргород"
            },
            {
                name: "Ямполь"
            }
        ]
    },
    {
        name: "Волынская область",
        city: [
            {
                name: "Берестечко"
            },
            {
                name: "Владимир-Волынский"
            },
            {
                name: "Горохов"
            },
            {
                name: "Камень-Каширский"
            },
            {
                name: "Киверцы"
            },
            {
                name: "Ковель"
            },
            {
                name: "Луцк"
            },
            {
                name: "Любомль"
            },
            {
                name: "Нововолынск"
            },
            {
                name: "Рожище"
            },
            {
                name: "Устилуг"
            }
        ]
    },
    {
        name: "Днепропетровская область",
        city: [
            {
                name: "Апостолово"
            },
            {
                name: "Верхнеднепровск"
            },
            {
                name: "Вольногорск"
            },
            {
                name: "Днепродзержинск"
            },
            {
                name: "Днепропетровск"
            },
            {
                name: "Жёлтые Воды"
            },
            {
                name: "Кривой Рог"
            },
            {
                name: "Марганец"
            },
            {
                name: "Никополь"
            },
            {
                name: "Новомосковск"
            },
            {
                name: "Орджоникидзе"
            },
            {
                name: "Павлоград"
            },
            {
                name: "Перещепино"
            },
            {
                name: "Першотравенск"
            },
            {
                name: "Подгородное"
            },
            {
                name: "Пятихатки"
            },
            {
                name: "Синельниково"
            },
            {
                name: "Терновка"
            }
        ]
    },
    {
        name: "Донецкая область",
        city: [
            {
                name: "Авдеевка"
            },
            {
                name: "Артёмовск"
            },
            {
                name: "Волноваха"
            },
            {
                name: "Горловка"
            },
            {
                name: "Дзержинск"
            },
            {
                name: "Дебальцево"
            },
            {
                name: "Димитров"
            },
            {
                name: "Доброполье"
            },
            {
                name: "Докучаевск"
            },
            {
                name: "Донецк"
            },
            {
                name: "Дружковка"
            },
            {
                name: "Енакиево"
            },
            {
                name: "Ждановка"
            },
            {
                name: "Зугрэс"
            },
            {
                name: "Кировское"
            },
            {
                name: "Краматорск"
            },
            {
                name: "Красноармейск"
            },
            {
                name: "Красный Лиман"
            },
            {
                name: "Константиновка"
            },
            {
                name: "Мариуполь"
            },
            {
                name: "Макеевка"
            },
            {
                name: "Новогродовка"
            },
            {
                name: "Селидово"
            },
            {
                name: "Славянск"
            },
            {
                name: "Снежное"
            },
            {
                name: "Соледар"
            },
            {
                name: "Торез"
            },
            {
                name: "Угледар"
            },
            {
                name: "Харцызск"
            },
            {
                name: "Шахтёрск"
            },
            {
                name: "Ясиноватая"
            }
        ]
    },
    {
        name: "Житомирская область",
        city: [
            {
                name: "Андрушёвка"
            },
            {
                name: "Барановка"
            },
            {
                name: "Бердичев"
            },
            {
                name: "Житомир"
            },
            {
                name: "Коростень"
            },
            {
                name: "Коростышев"
            },
            {
                name: "Малин"
            },
            {
                name: "Новоград-Волынский"
            },
            {
                name: "Овруч"
            },
            {
                name: "Радомышль"
            }
        ]
    },
    {
        "@name": "Закарпатская область",
        "city": [
            {
                name: "Берегово"
            },
            {
                name: "Виноградов"
            },
            {
                name: "Иршава"
            },
            {
                name: "Мукачево"
            },
            {
                name: "Перечин"
            },
            {
                name: "Рахов"
            },
            {
                name: "Свалява"
            },
            {
                name: "Тячев"
            },
            {
                name: "Ужгород"
            },
            {
                name: "Хуст"
            },
            {
                name: "Чоп"
            }
        ]
    },
    {
        name: "Запорожская область",
        city: [
            {
                name: "Бердянск"
            },
            {
                name: "Васильевка"
            },
            {
                name: "Вольнянск"
            },
            {
                name: "Гуляйполе"
            },
            {
                name: "Днепрорудное"
            },
            {
                name: "Запорожье"
            },
            {
                name: "Каменка-Днепровская"
            },
            {
                name: "Мелитополь"
            },
            {
                name: "Молочанск"
            },
            {
                name: "Орехов"
            },
            {
                name: "Пологи"
            },
            {
                name: "Приморск"
            },
            {
                name: "Токмак"
            },
            {
                name: "Энергодар"
            }
        ]
    },
    {
        name: "Ивано-Франковская область",
        city: [
            {
                name: "Болехов"
            },
            {
                name: "Бурштын"
            },
            {
                name: "Галич"
            },
            {
                name: "Городенка"
            },
            {
                name: "Долина"
            },
            {
                name: "Ивано-Франковск"
            },
            {
                name: "Калуш"
            },
            {
                name: "Коломыя"
            },
            {
                name: "Косов"
            },
            {
                name: "Надворная"
            },
            {
                name: "Рогатин"
            },
            {
                name: "Снятын"
            },
            {
                name: "Тысменица"
            },
            {
                name: "Тлумач"
            },
            {
                name: "Яремче"
            }
        ]
    },
    {
        name: "Киевская область",
        city: [
            {
                name: "Белая Церковь"
            },
            {
                name: "Березань"
            },
            {
                name: "Богуслав"
            },
            {
                name: "Борисполь"
            },
            {
                name: "Боярка"
            },
            {
                name: "Бровары"
            },
            {
                name: "Буча"
            },
            {
                name: "Васильков"
            },
            {
                name: "Вишнёвое"
            },
            {
                name: "Вышгород"
            },
            {
                name: "Ирпень"
            },
            {
                name: "Кагарлык"
            },
            {
                name: "Киев"
            },
            {
                name: "Мироновка"
            },
            {
                name: "Обухов"
            },
            {
                name: "Переяслав-Хмельницкий"
            },
            {
                name: "Припять"
            },
            {
                name: "Ржищев"
            },
            {
                name: "Сквира"
            },
            {
                name: "Славутич"
            },
            {
                name: "Тараща"
            },
            {
                name: "Тетиев"
            },
            {
                name: "Узин"
            },
            {
                name: "Украинка"
            },
            {
                name: "Фастов"
            },
            {
                name: "Чернобыль"
            },
            {
                name: "Яготин"
            }
        ]
    },
    {
        name: "Кировоградская область",
        city: [
            {
                name: "Александрия"
            },
            {
                name: "Бобринец"
            },
            {
                name: "Гайворон"
            },
            {
                name: "Долинская"
            },
            {
                name: "Знаменка"
            },
            {
                name: "Кировоград"
            },
            {
                name: "Малая Виска"
            },
            {
                name: "Новомиргород"
            },
            {
                name: "Новоукраинка"
            },
            {
                name: "Светловодск"
            }
        ]
    },
    {
        name: "Луганская область",
        city: [
            {
                name: "Александровск"
            },
            {
                name: "Алмазная"
            },
            {
                name: "Алчевск"
            },
            {
                name: "Антрацит"
            },
            {
                name: "Брянка"
            },
            {
                name: "Вахрушево"
            },
            {
                name: "Горное"
            },
            {
                name: "Зимогорье"
            },
            {
                name: "Золотое"
            },
            {
                name: "Зоринск"
            },
            {
                name: "Краснодон"
            },
            {
                name: "Красный Луч"
            },
            {
                name: "Лисичанск"
            },
            {
                name: "Луганск"
            },
            {
                name: "Лутугино"
            },
            {
                name: "Миусинск"
            },
            {
                name: "Молодогвардейск"
            },
            {
                name: "Новодружеск"
            },
            {
                name: "Новопсков"
            },
            {
                name: "Первомайск"
            },
            {
                name: "Перевальск"
            },
            {
                name: "Петровское"
            },
            {
                name: "Попасная"
            },
            {
                name: "Приволье"
            },
            {
                name: "Ровеньки"
            },
            {
                name: "Рубежное"
            },
            {
                name: "Сватово"
            },
            {
                name: "Свердловск"
            },
            {
                name: "Северодонецк"
            },
            {
                name: "Старобельск"
            },
            {
                name: "Стаханов"
            },
            {
                name: "Суходольск"
            },
            {
                name: "Счастье"
            },
            {
                name: "Теплогорск"
            },
            {
                name: "Червонопартизанск"
            }
        ]
    },
    {
        name: "Львовская область",
        city: [
            {
                name: "Белз"
            },
            {
                name: "Бобрка"
            },
            {
                name: "Борислав"
            },
            {
                name: "Броды"
            },
            {
                name: "Буск"
            },
            {
                name: "Великие Мосты"
            },
            {
                name: "Глиняны"
            },
            {
                name: "Городок"
            },
            {
                name: "Добромиль"
            },
            {
                name: "Дрогобыч"
            },
            {
                name: "Дубляны"
            },
            {
                name: "Жидачов"
            },
            {
                name: "Жолква"
            },
            {
                name: "Золочев"
            },
            {
                name: "Каменка-Бугская"
            },
            {
                name: "Львов"
            },
            {
                name: "Мостиска"
            },
            {
                name: "Перемышляны"
            },
            {
                name: "Пустомыты"
            },
            {
                name: "Рава-Русская"
            },
            {
                name: "Радехов"
            },
            {
                name: "Рудки"
            },
            {
                name: "Самбор"
            },
            {
                name: "Сколе"
            },
            {
                name: "Сокаль"
            },
            {
                name: "Старый Самбор"
            },
            {
                name: "Стрый"
            },
            {
                name: "Трускавец"
            },
            {
                name: "Угнев"
            },
            {
                name: "Хыров"
            },
            {
                name: "Червоноград"
            },
            {
                name: "Яворов"
            }
        ]
    },
    {
        name: "Николаевская область",
        city: [
            {
                name: "Баштанка"
            },
            {
                name: "Вознесенск"
            },
            {
                name: "Николаев"
            },
            {
                name: "Новая Одесса"
            },
            {
                name: "Новый Буг"
            },
            {
                name: "Очаков"
            },
            {
                name: "Первомайск"
            },
            {
                name: "Снигирёвка"
            },
            {
                name: "Южноукраинск"
            }
        ]
    },
    {
        name: "Одесская область",
        city: [
            {
                name: "Ананьев"
            },
            {
                name: "Арциз"
            },
            {
                name: "Балта"
            },
            {
                name: "Белгород-Днестровский"
            },
            {
                name: "Болград"
            },
            {
                name: "Измаил"
            },
            {
                name: "Ильичёвск"
            },
            {
                name: "Килия"
            },
            {
                name: "Кодыма"
            },
            {
                name: "Котовск"
            },
            {
                name: "Одесса"
            },
            {
                name: "Татарбунары"
            },
            {
                name: "Теплодар"
            },
            {
                name: "Южное"
            }
        ]
    },
    {
        name: "Полтавская область",
        city: [
            {
                name: "Гадяч"
            },
            {
                name: "Глобино"
            },
            {
                name: "Гребёнка"
            },
            {
                name: "Зеньков"
            },
            {
                name: "Карловка"
            },
            {
                name: "Кременчуг"
            },
            {
                name: "Кобеляки"
            },
            {
                name: "Комсомольск"
            },
            {
                name: "Лохвица"
            },
            {
                name: "Лубны"
            },
            {
                name: "Миргород"
            },
            {
                name: "Пирятин"
            },
            {
                name: "Полтава"
            },
            {
                name: "Хорол"
            },
            {
                name: "Червонозаводское"
            }
        ]
    },
    {
        name: "Ровенская область",
        city: [
            {
                name: "Березне"
            },
            {
                name: "Дубно"
            },
            {
                name : "Дубровица"
            },
            {
                name: "Здолбунов"
            },
            {
                name: "Корец"
            },
            {
                name: "Костополь"
            },
            {
                name: "Кузнецовск"
            },
            {
                name: "Острог"
            },
            {
                name : "Радивилов"
            },
            {
                name: "Ровно"
            },
            {
                name : "Сарны"
            }
        ]
    },
    {
        name: "Сумская область",
        city: [
            {
                name: "Ахтырка"
            },
            {
                name: "Белополье"
            },
            {
                name: "Бурынь"
            },
            {
                name: "Глухов"
            },
            {
                name: "Кролевец"
            },
            {
                name: "Конотоп"
            },
            {
                name: "Лебедин"
            },
            {
                name: "Путивль"
            },
            {
                name: "Ромны"
            },
            {
                name: "Середина-Буда"
            },
            {
                name: "Сумы"
            },
            {
                name: "Тростянец"
            },
            {
                name: "Шостка"
            }
        ]
    },
    {
        name: "Тернопольская область",
        city: [
            {
                name: "Бережаны"
            },
            {
                name: "Борщёв"
            },
            {
                name: "Бучач"
            },
            {
                name: "Залещики"
            },
            {
                name: "Збараж"
            },
            {
                name: "Зборов"
            },
            {
                name: "Кременец"
            },
            {
                name: "Лановцы"
            },
            {
                name: "Монастыриска"
            },
            {
                name: "Подволочиск"
            },
            {
                name: "Подгайцы"
            },
            {
                name: "Почаев"
            },
            {
                name: "Скалат"
            },
            {
                name: "Тернополь"
            },
            {
                name: "Теребовля"
            },
            {
                name: "Чортков"
            },
            {
                name: "Шумск"
            }
        ]
    },
    {
        name: "Харьковская область",
        city: [
            {
                name: "Балаклея"
            },
            {
                name: "Барвенково"
            },
            {
                name: "Богодухов"
            },
            {
                name: "Валки"
            },
            {
                name: "Великий Бурлук"
            },
            {
                name: "Волчанск"
            },
            {
                name: "Дергачи"
            },
            {
                name: "Змиев"
            },
            {
                name: "Изюм"
            },
            {
                name: "Красноград"
            },
            {
                name: "Купянск"
            },
            {
                name: "Лозовая"
            },
            {
                name: "Люботин"
            },
            {
                name: "Мерефа"
            },
            {
                name: "Первомайский"
            },
            {
                name: "Харьков"
            },
            {
                name: "Чугуев"
            }
        ]
    },
    {
        name: "Херсонская область",
        city: [
            {
                name: "Берислав"
            },
            {
                name: "Геническ"
            },
            {
                name: "Голая Пристань"
            },
            {
                name: "Каховка"
            },
            {
                name: "Новая Каховка"
            },
            {
                name: "Скадовск"
            },
            {
                name: "Таврийск"
            },
            {
                name: "Херсон"
            },
            {
                name: "Цюрупинск"
            }
        ]
    },
    {
        name: "Хмельницкая область",
        city: [
            {
                name: "Волочиск"
            },
            {
                name: "Городок"
            },
            {
                name: "Деражня"
            },
            {
                name: "Дунаевцы"
            },
            {
                name: "Изяслав"
            },
            {
                name: "Каменец-Подольский"
            },
            {
                name: "Красилов"
            },
            {
                name: "Нетешин"
            },
            {
                name: "Полонное"
            },
            {
                name: "Славута"
            },
            {
                name: "Староконстантинов"
            },
            {
                name: "Хмельницкий"
            },
            {
                name: "Шепетовка"
            }
        ]
    },
    {
        name: "Черкасская область",
        city: [
            {
                name: "Ватутино"
            },
            {
                name: "Городище"
            },
            {
                name: "Жашков"
            },
            {
                name: "Звенигородка"
            },
            {
                name: "Золотоноша"
            },
            {
                name: "Каменка"
            },
            {
                name: "Канев"
            },
            {
                name: "Корсунь-Шевченковский"
            },
            {
                name: "Монастырище"
            },
            {
                name: "Смела"
            },
            {
                name: "Тальное"
            },
            {
                name: "Умань"
            },
            {
                name: "Христиновка"
            },
            {
                name: "Черкассы"
            },
            {
                name: "Чигирин"
            },
            {
                name: "Шпола"
            }
        ]
    },
    {
        name: "Черниговская область",
        city: [
            {
                name: "Бахмач"
            },
            {
                name: "Бобровица"
            },
            {
                name: "Борзна"
            },
            {
                name: "Городня"
            },
            {
                name: "Десна"
            },
            {
                name: "Ичня"
            },
            {
                name: "Корюковка"
            },
            {
                name: "Мена"
            },
            {
                name: "Нежин"
            },
            {
                name: "Новгород-Северский"
            },
            {
                name: "Носовка"
            },
            {
                name: "Прилуки"
            },
            {
                name: "Седнев"
            },
            {
                name: "Семёновка"
            },
            {
                name: "Чернигов"
            },
            {
                name: "Щорс"
            }
        ]
    },
    {
        name: "Черновицкая область",
        city: [
            {
                name: "Вашковцы"
            },
            {
                name: "Вижница"
            },
            {
                name: "Герца"
            },
            {
                name: "Заставна"
            },
            {
                name: "Кицмань"
            },
            {
                name: "Новоднестровск"
            },
            {
                name: "Новоселица"
            },
            {
                name: "Сокиряны"
            },
            {
                name: "Сторожинец"
            },
            {
                name: "Хотин"
            },
            {
                name: "Черновцы"
            }
        ]
    }

]
